## 1. Make a Pandas DataFrame with two-dimensional list

In [2]:
# import pandas as pd 
import pandas as pd  
      
# List1  
lst = [['Anita', 25], ['Rohan', 30], 
       ['Shivi', 26], ['Vicky', 22]] 
  
# creating df object with columns specified    
df = pd.DataFrame(lst, columns =['Student_name', 'Marks']) 
print(df )

  Student_name  Marks
0        Anita     25
1        Rohan     30
2        Shivi     26
3        Vicky     22

## 2. Creating DataFrame from dict of narray/lists

### (i) Create a DataFrame from a Numpy ndarray

In [3]:
import pandas as pd
import numpy as np

d = np.random.normal(size=(2,3))
print("The original Numpy array")
print(d)

s = pd.DataFrame(d)
print("The DataFrame ")
print(s)

The original Numpy array
[[ 0.51473423  0.70286054  1.17031384]
 [ 0.20568073 -1.30176726  1.26029542]]
The DataFrame
          0         1         2
0  0.514734  0.702861  1.170314
1  0.205681 -1.301767  1.260295

### (ii) Create a DataFrame from a dictionary of lists

In [7]:
d = {"a": {"a1":1, "a2":2,"b2":7, "c":3}, "b":{"a1":5,"b1":2, "b2":4, "c":9}}
df = pd.DataFrame(d)
print("The DataFrame ")
print(df)

The DataFrame
      a    b
a1  1.0  5.0
a2  2.0  NaN
b2  7.0  4.0
c   3.0  9.0
b1  NaN  2.0

## 3. Creating Pandas dataframe using list of lists

In [8]:
import pandas as pd
data = [['A', 10], ['B', 15], ['C', 20],['D', 21]]
df = pd.DataFrame(data, columns = ['Name', 'Age'])
print(df)

  Name  Age
0    A   10
1    B   15
2    C   20
3    D   21

## 4. Creating a Pandas dataframe using list of tuples

In [9]:
import pandas as pd
data = [('A', 10), ('B', 15), ('C', 20),('D', 21)]
df = pd.DataFrame(data, columns = ['Name', 'Age'])
print(df)

  Name  Age
0    A   10
1    B   15
2    C   20
3    D   21

## 5. Create a Pandas DataFrame from List of Dicts

In [10]:
import pandas as pd
data = [{'points': 50, 'time': '5:00', 'year': 2010}, 
 {'points': 25, 'time': '6:00', 'month': "february"}, 
 {'points':90, 'time': '9:00', 'month': 'january'}, 
 {'points_h1':20, 'month': 'june'}]
 
df = pd.DataFrame.from_records(data)
print(df)

   points  time    year     month  points_h1
0    50.0  5:00  2010.0       NaN        NaN
1    25.0  6:00     NaN  february        NaN
2    90.0  9:00     NaN   january        NaN
3     NaN   NaN     NaN      june       20.0

## 6. Convert list of nested dictionary into Pandas dataframe

In [15]:
import pandas as pd

# Given nested dictionary
list = [
   {
      "Fruit": [{"Price": 15.2, "Quality": "A"},
         {"Price": 19, "Quality": "B"},
         {"Price": 17.8, "Quality": "C"},
      ],
      "Name": "Orange"
   },
    {
      "Fruit": [{"Price": 23.2, "Quality": "A"},
         {"Price": 28, "Quality": "B"}
      ],
      "Name": "Grapes"
   }
]

rows = []

# Getting rows
for data in list:
   data_row = data['Fruit']
   n = data['Name']

   for row in data_row:
      row['Name'] = n
      rows.append(row)

# Convert to data frame
df = pd.DataFrame(rows)
print(df)

   Price Quality    Name
0   15.2       A  Orange
1   19.0       B  Orange
2   17.8       C  Orange
3   23.2       A  Grapes
4   28.0       B  Grapes

## 7. Replace values in Pandas dataframe using regex

Suppose you want to replace all the domain suffixes such as 
.com, .in, .tech, etc to .edu in the email column of the dataset.
The regex pattern for this case will be \.\w+.

In [1]:

import pandas as pd

df = pd.DataFrame(
                   data= [
                        ['@mlplus', 'We are excited to launch our new course on ML. #newcourse #machinelearning #python','mlplus@mlplus.tech'],
                        ['@kaustubhgupta', "@gmail Gmail is down for 30 minutes. What's the matter? #gmaildown #google #gmail",'kaustubh@random.in'],
                        ['@rajveer', 'Excited to lauch our new product! #newproduct #startup ','rajveer@twitter.me'],
                        ['@joe', 'When will this coronavirus end? #thoughts','joe@facebook.pl'],
                        ['@abhishek', 'I want to become web developer. Any tips? @webdeveloper @randomxyz','abhishek@orkut.tech'],
                        ['@ayushi', 'Missing college! @colllege','ayushi@space.org' ]
                         ],
                    columns=['twitter_username', 'tweet', 'email']
                )
df

,twitter_username,tweet,email
0,@mlplus,We are excited to launch our new course on ML....,mlplus@mlplus.tech
1,@kaustubhgupta,@gmail Gmail is down for 30 minutes. What's th...,kaustubh@random.in
2,@rajveer,Excited to lauch our new product! #newproduct ...,rajveer@twitter.me
3,@joe,When will this coronavirus end? #thoughts,joe@facebook.pl
4,@abhishek,I want to become web developer. Any tips? @web...,abhishek@orkut.tech
5,@ayushi,Missing college! @colllege,ayushi@space.org

In [2]:
df.tweet[0]

'We are excited to launch our new course on ML. #newcourse #machinelearning #python'

In [3]:
df.tweet.replace(to_replace='#\w+', regex=True, value='')[0]

'We are excited to launch our new course on ML.   '

## 8. Creating a dataframe from Pandas series

In [5]:
import pandas as pd
author = ['Jitender', 'Purnima', 'Arpit', 'Jyoti']
auth_series = pd.Series(author)
print(auth_series)

0    Jitender
1     Purnima
2       Arpit
3       Jyoti
dtype: object

In [6]:
print(type(auth_series))

<class 'pandas.core.series.Series'>

## 9. Construct a DataFrame in Pandas using string data

In [7]:
import pandas as pd
from io import StringIO
str_data = StringIO("""Id;Subject;Course_Fee
                    10;DBMS;3000
                    11;Basic Maths;2000
                    12;Data Science;40000
                    13;Algorithm;5000
                       """)
df = pd.read_csv(str_data, sep =";")
print(df)

   Id       Subject  Course_Fee
0  10          DBMS        3000
1  11   Basic Maths        2000
2  12  Data Science       40000
3  13     Algorithm        5000

## 10. Clean the string data in the given Pandas Dataframe

In [13]:
import pandas as pd
df = pd.DataFrame({'Date':['10/2/2011', '11/2/2011', '12/2/2011', '13/2/2011'],
                   'Product':[' UMbreLla', '  maTtress', 'BaDmintoN ', 'Shuttle'],
                   'Updated_Price':[1250, 1450, 1550, 400],
                   'Discount':[10, 8, 15, 10]})
print(df)

        Date     Product  Updated_Price  Discount
0  10/2/2011    UMbreLla           1250        10
1  11/2/2011    maTtress           1450         8
2  12/2/2011  BaDmintoN            1550        15
3  13/2/2011     Shuttle            400        10

In [14]:
df['Product'] = df['Product'].apply(lambda x : x.strip().capitalize())
print(df)

        Date    Product  Updated_Price  Discount
0  10/2/2011   Umbrella           1250        10
1  11/2/2011   Mattress           1450         8
2  12/2/2011  Badminton           1550        15
3  13/2/2011    Shuttle            400        10

## 11. Reindexing in Pandas DataFrame

In [15]:
import pandas as pd
import numpy as np

column = ['a', 'b', 'c', 'd', 'e']
index = ['A', 'B', 'C', 'D', 'E']

df1 = pd.DataFrame(np.random.rand(5, 5),
        columns = column, index = index)

new_index =['U', 'A', 'B', 'C', 'Z']
print(df1.reindex(new_index))

          a         b         c         d         e
U       NaN       NaN       NaN       NaN       NaN
A  0.318008  0.320960  0.795162  0.766260  0.210861
B  0.838651  0.224942  0.749789  0.811247  0.622626
C  0.576080  0.078624  0.761888  0.100063  0.805067
Z       NaN       NaN       NaN       NaN       NaN

## 12. Mapping external values to dataframe values in Pandas

In [16]:
import pandas as pd
  
initial_data = {'First_name': ['Ram', 'Mohan', 'Tina', 'Jeetu', 'Meera'], 
        'Last_name': ['Kumar', 'Sharma', 'Ali', 'Gandhi', 'Kumari'], 
        'Age': [42, 52, 36, 21, 23], 
        'City': ['Mumbai', 'Noida', 'Pune', 'Delhi', 'Bihar']}
  
df = pd.DataFrame(initial_data, columns = ['First_name', 'Last_name',
                                                      'Age', 'City'])

new_data = { "Ram":"B.Com",
             "Mohan":"IAS",
             "Tina":"LLB",
             "Jeetu":"B.Tech",
             "Meera":"MBBS" }

df["Qualification"] = df["First_name"].map(new_data)
  
print(df)

  First_name Last_name  Age    City Qualification
0        Ram     Kumar   42  Mumbai         B.Com
1      Mohan    Sharma   52   Noida           IAS
2       Tina       Ali   36    Pune           LLB
3      Jeetu    Gandhi   21   Delhi        B.Tech
4      Meera    Kumari   23   Bihar          MBBS

## 13. Reshape a pandas DataFrame using stack, unstack and melt method

In [26]:
# stack() function

In [23]:
df_single_level_cols = pd.DataFrame([[7, 9], [11, 13]],
                                     index=['Bugatti', 'Mclaren'],
                                    columns=['weight', 'speed'])

df_single_level_cols

         weight  speed
Bugatti       7      9
Mclaren      11     13

In [25]:
df_single_level_cols.stack()

Bugatti  weight     7
         speed      9
Mclaren  weight    11
         speed     13
dtype: int64

In [27]:
# unstack() function

In [30]:
index = pd.MultiIndex.from_tuples([('red', 'p'), ('red', 'q'),
                                   ('blue', 'p'), ('blue', 'q')])

df = s.unstack(level=0)
df.unstack()

blue  p    8.0
      q    9.0
red   p    6.0
      q    7.0
dtype: float64

In [33]:
# melt() function

In [34]:
df = pd.DataFrame({'A': {0: 'p', 1: 'q', 2: 'r'},
                    'B': {0: 2, 1: 4, 2: 6},
                    'C': {0: 5, 1: 7, 2: 9}})
df

   A  B  C
0  p  2  5
1  q  4  7
2  r  6  9

In [35]:
pd.melt(df, id_vars=['A'], value_vars=['B'])

   A variable  value
0  p        B      2
1  q        B      4
2  r        B      6

In [36]:
pd.melt(df, id_vars=['A'], value_vars=['B', 'C'])

   A variable  value
0  p        B      2
1  q        B      4
2  r        B      6
3  p        C      5
4  q        C      7
5  r        C      9

## 14.Reset Index in Pandas Dataframe

In [39]:
# Reset own index and make default index as index.

import pandas as pd
data = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj', 'Geeku'],
        'Age':[27, 24, 22, 32, 15],
        'Address':['Delhi', 'Kanpur', 'Allahabad', 'Kannauj', 'Noida'],
        'Qualification':['Msc', 'MA', 'MCA', 'Phd', '10th'] }

# Create own index
index = {'a', 'b', 'c', 'd', 'e'}

df = pd.DataFrame(data, index)

df

     Name  Age    Address Qualification
b     Jai   27      Delhi           Msc
d  Princi   24     Kanpur            MA
c  Gaurav   22  Allahabad           MCA
e    Anuj   32    Kannauj           Phd
a   Geeku   15      Noida          10th

## 15. Change column names and row indexes in Pandas DataFrame

In [40]:
import pandas as pd
df=pd.DataFrame({"Name":['Tom','Nick','John','Peter'],
                 "Age":[15,26,17,28]})

df

    Name  Age
0    Tom   15
1   Nick   26
2   John   17
3  Peter   28

In [41]:
# Change the column names
df.columns =['Col_1', 'Col_2']
  
# Change the row indexes
df.index = ['Row_1', 'Row_2', 'Row_3', 'Row_4']
  
# printing the data frame
df

       Col_1  Col_2
Row_1    Tom     15
Row_2   Nick     26
Row_3   John     17
Row_4  Peter     28